# cоздаем словарь, который будет содержать информацию о книгах
books = {
    1: {"title": "Этюд в багровых тонах", "author": "Артур Конан Дойл", "year": 1887},  # книга 1 о Шерлоке Холмсе
    2: {"title": "Собака Баскервилей", "author": "Артур Конан Дойл", "year": 1902},  # книга 2 о Шерлоке Холмсе
    3: {"title": "Убийство в Восточном экспрессе", "author": "Агата Кристи", "year": 1934},  # книга 3 Агаты Кристи
    4: {"title": "Десять негритят", "author": "Агата Кристи", "year": 1939},  # книга 4 Агаты Кристи
    5: {"title": "Знак четырех", "author": "Артур Конан Дойл", "year": 1890}  # книга 5 о Шерлоке Холмсе
}
# запускаем цикл по всем книгам в словаре
for key, book in books.items():  # проходим по каждому ключу и значению в словаре
    print("---------------------- Книга", key, "-----------------------")  # выводим заголовок книги
    print("Название:", book["title"], ", Автор:", book["author"])  # выводим название и автора книги
    print("-------------------------" + str(book["year"]) + "-------------------------")  # выводим год издания
    print()  # печатаем пустую строку для разделения между книгами
